import 'package:animate_do/animate_do.dart';
import 'package:flutter/material.dart';
import 'package:localize_and_translate/localize_and_translate.dart';
import 'package:provider/provider.dart';
import 'package:qurany_karim/view_model/azkar/azkar_view_model.dart';
import 'package:qurany_karim/view_model/azkar/states.dart';
import '../app_components.dart';
import 'azkar_details_view.dart';
import 'components.dart';

class AzkarView extends StatelessWidget {
  const AzkarView({Key key}) : super(key: key);
  static const String id = 'AzkarView';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        automaticallyImplyLeading: true,
        title: Hero(
          tag: 'azkar'.tr(),
          child: Text('azkar'.tr()),
        ),
      ),
      body: Consumer<AzkarViewModel>(
        builder: (context, provider, child) {
          if (provider.categoriesStates == AzkarCategoriesStates.Initial) {
            provider.getCategories(context);
            return BuildLoadingWidget();
          } else if (provider.categoriesStates ==
              AzkarCategoriesStates.Loading) {
            return BuildLoadingWidget();
          } else if (provider.categoriesStates ==
              AzkarCategoriesStates.Loaded) {
            return FadeInRight(
              child: ListView.separated(
                padding: const EdgeInsets.symmetric(vertical: 10.0),
                physics: const BouncingScrollPhysics(),
                itemCount: provider.categories.length,
                itemBuilder: (_, index) {
                  return BuildAzkarCategoryWidgetItem(
                    name: provider.categories[index].name,
                    onClick: () async {
                      await provider.getAzkarDetails(context,
                          categoryId: provider.categories[index].id);
                      materialNavigator(
                        context,
                        AzkarDetailsView(title: provider.categories[index].name),
                      );
                    },
                  );
                },
                separatorBuilder: (_, index) => minimumVerticalSpace(),
              ),
            );
          } else {
            return BuildErrorWidget(
              errorResult: provider.error,
            );
          }
        },
      ),
    );
  }
}

//
//
// import 'package:flutter/material.dart';
// class StorageUpload extends StatefulWidget {
//   @override
//   StorageUploadState createState() => new StorageUploadState();
// }
//
// class StorageUploadState extends State<StorageUpload> {
//   List results = [];
//
//   var rows = [];
//   String query = '';
//   TextEditingController tc;
//
//   @override
//   void initState() {
//     super.initState();
//     tc = TextEditingController();
//     rows = [
//       {
//         "number": 1,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ الْقَعْنَبِيُّ ‏ ‏حَدَّثَنَا ‏ ‏عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ ‏ ‏عَنْ ‏ ‏مُحَمَّدٍ يَعْنِي ابْنَ عَمْرٍو ‏ ‏عَنْ ‏ ‏أَبِي سَلَمَةَ ‏ ‏عَنْ ‏ ‏الْمُغِيرَةِ بْنِ شُعْبَةَ ‏ ‏أَنَّ النَّبِيَّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏كَانَ ‏ ‏إِذَا ذَهَبَ الْمَذْهَبَ أَبْعَدَ ‏",
//         "description": "‏ ‏( مَسْلَمَة ) ‏ ‏: بِفَتْحِ الْمِيم وَسُكُون السِّين , ‏ ‏( الْقَعْنَبِيّ ) ‏ ‏: بِفَتْحِ الْقَاف وَسُكُون الْعَيْن وَفَتْح النُّون , مَنْسُوب إِلَى قَعْنَب جَدّ عَبْد اللَّه بْن مَسْلَمَة , ‏ ‏( أَبِي سَلَمَة ) ‏ ‏: هُوَ اِبْن عَبْد الرَّحْمَن بْن عَوْف الزُّهْرِيّ ثِقَة فَقِيه ‏ ‏( الْمَذْهَب ) ‏ ‏: مَوْضِع التَّغَوُّط أَوْ مَصْدَر مِيمِيّ بِمَعْنَى الذَّهَاب الْمَعْهُود , وَهُوَ الذَّهَاب إِلَى مَوْضِع التَّغَوُّط. ‏ ‏قَالَ الْعِرَاقِيّ : هُوَ بِفَتْحِ الْمِيم وَإِسْكَان الذَّال وَفَتْح الْهَاء مَفْعَل مِنْ الذَّهَاب , وَيُطْلَق عَلَى مَعْنَيَيْنِ : أَحَدهمَا الْمَكَان الَّذِي يُذْهَب إِلَيْهِ. ‏ ‏وَالثَّانِي الْمَصْدَر , يُقَال ذَهَبَ ذَهَابًا وَمَذْهَبًا , فَيَحْتَمِل أَنْ يُرَاد الْمَكَان , فَيَكُون التَّقْدِير إِذَا ذَهَبَ فِي الْمَذْهَب , لِأَنَّ شَأْن الظُّرُوف تَقْدِيرهَا بِفِي وَيَحْتَمِل أَنْ يُرَاد الْمَصْدَر , أَيْ إِذَا ذَهَبَ مَذْهَبًا , وَالِاحْتِمَال الْأَوَّل هُوَ الْمَنْقُول عَنْ أَهْل الْعَرَبِيَّة. ‏ ‏وَقَالَ بِهِ أَبُو عُبَيْد وَغَيْره وَجَزَمَ بِهِ فِي النِّهَايَة وَيُوَافِق الِاحْتِمَال الثَّانِي قَوْله فِي رِوَايَة التِّرْمِذِيّ : أَتَى حَاجَته فَأَبْعَدَ فِي الْمَذْهَب. ‏ ‏فَإِنَّهُ يَتَعَيَّن فِيهَا أَنْ يُرَاد بِالْمَذْهَبِ الْمَصْدَر , ‏ ‏( أَبْعَدَ ) ‏ ‏: فِي مَوْضِع ذَهَابه أَوْ فِي الذَّهَاب الْمَعْهُود , أَيْ أَكْثَرَ الْمَشْيَ حَتَّى بَعُدَ عَنْ النَّاس فِي مَوْضِع ذَهَابه. ‏ ‏وَالْحَدِيث أَخْرَجَهُ الدَّارِمِيُّ وَالنَّسَائِيُّ وَابْن مَاجَهْ وَالتِّرْمِذِيّ وَقَالَ حَسَن صَحِيح. ‏",
//         "searchTerm": " حدثنا عبد الله بن مسلمة بن قعنب القعنبي حدثنا عبد العزيز يعني ابن محمد عن محمد يعني ابن عمرو عن أبي سلمة عن المغيرة بن شعبة أن النبي صلى الله عليه وسلم كان إذا ذهب المذهب أبعد "
//       },
//       {
//         "number": 2,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُسَدَّدُ بْنُ مُسَرْهَدٍ ‏ ‏حَدَّثَنَا ‏ ‏عِيسَى بْنُ يُونُسَ ‏ ‏أَخْبَرَنَا ‏ ‏إِسْمَعِيلُ بْنُ عَبْدِ الْمَلِكِ ‏ ‏عَنْ ‏ ‏أَبِي الزُّبَيْرِ ‏ ‏عَنْ ‏ ‏جَابِرِ بْنِ عَبْدِ اللَّهِ ‏ ‏أَنَّ النَّبِيَّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏كَانَ ‏ ‏إِذَا أَرَادَ الْبَرَازَ انْطَلَقَ حَتَّى لَا يَرَاهُ أَحَدٌ ‏",
//         "description": "‏ ‏( أَبِي الزُّبَيْر ) ‏ ‏: هُوَ مُحَمَّد بْن مُسْلِم الْمَكِّيّ , وَثَّقَهُ الْجُمْهُور وَضَعَّفَهُ بَعْضهمْ لِكَثْرَةِ التَّدْلِيس ‏ ‏( الْبَرَاز ) ‏ ‏قَالَ الْخَطَّابِيُّ : مَفْتُوحَة الْبَاء , اِسْم لِلْفَضَاءِ الْوَاسِع مِنْ الْأَرْض , كَنَّوْا بِهِ عَنْ حَاجَة الْإِنْسَان كَمَا كَنَّوْا بِالْخَلَاءِ عَنْهُ , يُقَال : تَبَرَّزَ الرَّجُل إِذَا تَغَوَّطَ وَهُوَ أَنْ يَخْرُج إِلَى الْبَرَاز , كَمَا قِيلَ : تَخَلَّى إِذَا صَارَ إِلَى الْخَلَاء , وَأَكْثَرُ الرُّوَاة يَقُولُونَ الْبِرَاز بِكَسْرِ الْبَاء وَهُوَ غَلَط , إِنَّمَا الْبِرَاز مَصْدَر بَارَزْت الرَّجُلَ فِي الْحَرْب مُبَارَزَةً وَبِرَازًا. ‏ ‏وَفِيهِ مِنْ الْأَدَب اِسْتِحْبَاب التَّبَاعُد عِنْد الْحَاجَة عَنْ حُضُور النَّاس إِذَا كَانَ فِي مَرَاح مِنْ الْأَرْض , وَيَدْخُل فِي مَعْنَاهُ الِاسْتِتَار بِالْأَبْنِيَةِ وَضَرْب الْحُجُب وَإِرْخَاء السِّتْر وَأَعْمَاق الْآبَار وَالْحَفَائِر , وَنَحْو ذَلِكَ مِنْ الْأُمُور السَّاتِرَة لِلْعَوْرَاتِ وَكُلّ مَا سَتَرَ الْعَوْرَة عَنْ النَّاس. ‏ ‏اِنْتَهَى. ‏ ‏قُلْت : وَخَطَّأَ الْخَطَّابِيُّ الْكَسْرَ وَخَالَفَهُ الْجَوْهَرِيّ فَجَعَلَهُ مُشْتَرَكًا بَيْنَهُمَا. ‏ ‏وَقَالَ فِي الْمِصْبَاح : الْبَرَاز بِالْفَتْحِ وَالْكَسْر لُغَة قَلِيلَة , الْفَضَاء الْوَاسِع الْخَالِي مِنْ الشَّجَر ثُمَّ كَنَّى بِالْغَائِطِ. ‏ ‏اِنْتَهَى. ‏ ‏وَالْحَدِيث فِيهِ إِسْمَاعِيل بْن عَبْد الْمَلِك الْكُوفِيّ نَزِيل مَكَّة , قَدْ تَكَلَّمَ فِيهِ غَيْر وَاحِد , وَأَخْرَجَهُ أَيْضًا اِبْن مَاجَهْ. ‏",
//         "searchTerm": " حدثنا مسدد بن مسرهد حدثنا عيسى بن يونس أخبرنا إسمعيل بن عبد الملك عن أبي الزبير عن جابر بن عبد الله أن النبي صلى الله عليه وسلم كان إذا أراد البراز انطلق حتى لا يراه أحد "
//       },
//       {
//         "number": 3,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُوسَى بْنُ إِسْمَعِيلَ ‏ ‏حَدَّثَنَا ‏ ‏حَمَّادٌ ‏ ‏أَخْبَرَنَا ‏ ‏أَبُو التَّيَّاحِ ‏ ‏قَالَ حَدَّثَنِي ‏ ‏شَيْخٌ ‏ ‏قَالَ ‏ ‏لَمَّا قَدِمَ ‏ ‏عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ‏ ‏الْبَصْرَةَ ‏ ‏فَكَانَ ‏ ‏يُحَدِّثُ عَنْ ‏ ‏أَبِي مُوسَى ‏ ‏فَكَتَبَ ‏ ‏عَبْدُ اللَّهِ ‏ ‏إِلَى ‏ ‏أَبِي مُوسَى ‏ ‏يَسْأَلُهُ عَنْ أَشْيَاءَ ‏ ‏فَكَتَبَ إِلَيْهِ ‏ ‏أَبُو مُوسَى ‏ ‏إِنِّي كُنْتُ مَعَ رَسُولِ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏ذَاتَ يَوْمٍ فَأَرَادَ أَنْ يَبُولَ فَأَتَى ‏ ‏دَمِثًا ‏ ‏فِي أَصْلِ جِدَارٍ فَبَالَ ثُمَّ قَالَ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَبُولَ ‏ ‏فَلْيَرْتَدْ ‏ ‏لِبَوْلِهِ مَوْضِعًا ‏",
//         "description": "‏ ‏( حَمَّاد ) ‏ ‏: هُوَ اِبْن سَلَمَة , قَالَ السُّيُوطِي : إِنَّ مُوسَى إِذَا أَطْلَقَ حَمَّادًا يُرِيد اِبْن سَلَمَة وَهُوَ قَلِيل الرِّوَايَة عَنْ حَمَّاد بْن زَيْد حَتَّى قِيلَ إِنَّهُ لَمْ يَرْوِ عَنْهُ إِلَّا حَدِيثًا ‏ ‏( أَبُو التَّيَّاح ) ‏ ‏: بِفَتْحِ الْمُثَنَّاة وَالتَّحْتَانِيَّة الثَّقِيلَة اِسْمه يَزِيد بْن حُمَيْدٍ ثِقَة ‏ ‏( فَكَانَ يُحَدَّث ) ‏ ‏عَلَى بِنَاء الْمَجْهُول , أَيْ كَانَ اِبْن عَبَّاس يُحَدَّث عَنْ أَبِي مُوسَى بِأَحَادِيث , وَالْمُحَدِّثُونَ عَنْ أَبِي مُوسَى كَانُوا بِالْبَصْرَةِ , لِأَنَّ فِي رِوَايَة الْبَيْهَقِيِّ : سَمِعَ أَهْل الْبَصْرَة يَتَحَدَّثُونَ عَنْ أَبِي مُوسَى ‏ ‏( دَمِثًا ) ‏ ‏: بِفَتْحِ الدَّال وَكَسْر الْمِيم. ‏ ‏قَالَ الْخَطَّابِيُّ : الدَّمِث : الْمَكَان السَّهْل الَّذِي يُجْذَب فِيهِ الْبَوْل فَلَا يَرْتَدّ عَلَى الْبَائِل , يُقَال لِلرَّجُلِ إِذَا وُصِفَ بِاللِّينِ وَالسُّهُولَة إِنَّهُ لَدَمِث الْأَخْلَاق وَفِيهِ دَمَاثَة ‏ ‏( فَلْيَرْتَدْ ) ‏ ‏: أَيْ لِيَطْلُب وَلْيَتَحَرَّ مَكَانًا لَيِّنًا , وَمِنْهُ الْمَثَل : الرَّائِد لَا يَكْذِب أَهْلَهُ , وَهُوَ الرَّجُل يَبْعَثهُ الْقَوْم يَطْلُب لَهُمْ الْمَاء وَالْكَلَأ , يُقَال : رَادَهُمْ يَرُودُهُمْ رِيَادًا. ‏ ‏وَارْتَادَ لَهُمْ اِرْتِيَادًا. ‏ ‏وَالْحَدِيث فِيهِ مَجْهُول لَكِنْ لَا يَضُرّ , فَإِنَّ أَحَادِيث الْأَمْر بِالتَّنَزُّهِ عَنْ الْبَوْل تُفِيد ذَلِكَ وَاللَّهُ أَعْلَمُ. ‏",
//         "searchTerm": " حدثنا موسى بن إسمعيل حدثنا حماد أخبرنا أبو التياح قال حدثني شيخ قال لما قدم عبد الله بن عباس البصرة فكان يحدث عن أبي موسى فكتب عبد الله إلى أبي موسى يسأله عن أشياء فكتب إليه أبو موسى إني كنت مع رسول الله صلى الله عليه وسلم ذات يوم فأراد أن يبول فأتى دمثا في أصل جدار فبال ثم قال صلى الله عليه وسلم إذا أراد أحدكم أن يبول فليرتد لبوله موضعا "
//       },
//       {
//         "number": 4,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏عَمْرُو بْنُ مَرْزُوقٍ ‏ ‏أَخْبَرَنَا ‏ ‏شُعْبَةُ ‏ ‏عَنْ ‏ ‏قَتَادَةَ ‏ ‏عَنْ ‏ ‏النَّضِرِ بْنِ أَنَسٍ ‏ ‏عَنْ ‏ ‏زَيْدِ بْنِ أَرْقَمَ ‏ ‏عَنْ رَسُولِ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏قَالَ ‏ ‏إِنَّ هَذِهِ ‏ ‏الْحُشُوشَ ‏ ‏مُحْتَضَرَةٌ ‏ ‏فَإِذَا أَتَى أَحَدُكُمْ الْخَلَاءَ فَلْيَقُلْ أَعُوذُ بِاللَّهِ مِنْ ‏ ‏الْخُبُثِ ‏ ‏وَالْخَبَائِثِ ‏",
//         "description": "‏ ‏( إِنَّ هَذِهِ الْحُشُوش ) ‏ ‏بِضَمِّ الْحَاء الْمُهْمَلَة وَشِينَيْنِ مُعْجَمَتَيْنِ , هِيَ الْكُنُف وَمَوَاضِع قَضَاء الْحَاجَة وَاحِدهَا حُشٌّ. ‏ ‏قَالَ الْخَطَّابِيُّ : وَأَصْل الْحُشّ جَمَاعَة النَّخْل الْمُتَكَاثِفَة , وَكَانُوا يَقْضُونَ حَوَائِجهمْ إِلَيْهَا قَبْل أَنْ تُتَّخَذ الْكُنُف فِي الْبُيُوت , وَفِيهِ لُغَتَانِ حَشّ وَحُشّ بِالْفَتْحِ وَالضَّمّ ‏ ‏( مُحْتَضَرَة ) ‏ ‏عَلَى الْبِنَاء لِلْمَجْهُولِ , أَيْ تَحْضُرهَا الْجِنّ وَالشَّيَاطِين وَتَنْتَابهَا لِقَصْدِ الْأَذَى. ‏ ‏وَالْحَدِيث أَخْرَجَهُ اِبْن مَاجَهْ وَالنَّسَائِيُّ فِي السُّنَن الْكُبْرَى. ‏",
//         "searchTerm": " حدثنا عمرو بن مرزوق أخبرنا شعبة عن قتادة عن النضر بن أنس عن زيد بن أرقم عن رسول الله صلى الله عليه وسلم قال إن هذه الحشوش محتضرة فإذا أتى أحدكم الخلاء فليقل أعوذ بالله من الخبث والخبائث "
//       },
//       {
//         "number": 5,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ ‏ ‏حَدَّثَنَا ‏ ‏ابْنُ الْمُبَارَكِ ‏ ‏عَنْ ‏ ‏مُحَمَّدِ بْنِ عَجْلَانَ ‏ ‏عَنْ ‏ ‏الْقَعْقَاعِ بْنِ حَكِيمٍ ‏ ‏عَنْ ‏ ‏أَبِي صَالِحٍ ‏ ‏عَنْ ‏ ‏أَبِي هُرَيْرَةَ ‏ ‏قَالَ ‏ ‏قَالَ رَسُولُ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏إِنَّمَا أَنَا لَكُمْ بِمَنْزِلَةِ الْوَالِدِ أُعَلِّمُكُمْ فَإِذَا أَتَى أَحَدُكُمْ ‏ ‏الْغَائِطَ ‏ ‏فَلَا يَسْتَقْبِلْ الْقِبْلَةَ وَلَا يَسْتَدْبِرْهَا وَلَا ‏ ‏يَسْتَطِبْ ‏ ‏بِيَمِينِهِ وَكَانَ يَأْمُرُ بِثَلَاثَةِ أَحْجَارٍ ‏ ‏وَيَنْهَى عَنْ الرَّوْثِ ‏ ‏وَالرِّمَّةِ ‏",
//         "description": "‏ ‏( النُّفَيْلِيّ ) ‏ ‏: بِضَمِّ النُّون مَنْسُوب إِلَى نُفَيْلٍ الْقُضَاعِيّ ‏ ‏( وَلَا يَسْتَطِبْ بِيَمِينِهِ ) ‏ ‏: أَيْ لَا يَسْتَنْجِي بِهَا , وَسُمِّيَ الِاسْتِنْجَاء الِاسْتِطَابَة , لِمَا فِيهِ مِنْ إِزَالَة النَّجَاسَة وَتَطْهِير مَوْضِعهَا مِنْ الْبَدَن , يُقَال : اِسْتَطَابَ الرَّجُل إِذَا اِسْتَنْجَى فَهُوَ مُسْتَطِيب وَأَطَابَ فَهُوَ مُطِيبٌ وَمَعْنَى الطِّيب هَاهُنَا الطَّهَارَة ‏ ‏( الرِّمَّة ) ‏ ‏: بِكَسْرِ الرَّاء وَشِدَّة الْمِيم , وَالرِّمَّة وَالرَّمِيم : الْعَظْم الْبَالِي أَوْ الرِّمَّة , جَمْع رَمِيم : أَيْ الْعِظَام الْبَالِيَة. ‏",
//         "searchTerm": " حدثنا عبد الله بن محمد النفيلي حدثنا ابن المبارك عن محمد بن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم إنما أنا لكم بمنزلة الوالد أعلمكم فإذا أتى أحدكم الغائط فلا يستقبل القبلة ولا يستدبرها ولا يستطب بيمينه وكان يأمر بثلاثة أحجار وينهى عن الروث والرمة "
//       },
//       {
//         "number": 6,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُسَدَّدُ بْنُ مُسَرْهَدٍ ‏ ‏حَدَّثَنَا ‏ ‏سُفْيَانُ ‏ ‏عَنْ ‏ ‏الزُّهْرِيِّ ‏ ‏عَنْ ‏ ‏عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ ‏ ‏عَنْ ‏ ‏أَبِي أَيُّوبَ ‏ ‏رِوَايَةً ‏ ‏قَالَ ‏ ‏إِذَا أَتَيْتُمْ ‏ ‏الْغَائِطَ ‏ ‏فَلَا تَسْتَقْبِلُوا الْقِبْلَةَ ‏ ‏بِغَائِطٍ ‏ ‏وَلَا بَوْلٍ وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا ‏ ‏فَقَدِمْنَا ‏ ‏الشَّامَ ‏ ‏فَوَجَدْنَا مَرَاحِيضَ قَدْ بُنِيَتْ قِبَلَ الْقِبْلَةِ فَكُنَّا نَنْحَرِفُ عَنْهَا وَنَسْتَغْفِرُ اللَّهَ ‏",
//         "description": "‏ ‏( سُفْيَان ) ‏ ‏: هُوَ اِبْن عُيَيْنَةَ ‏ ‏( وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا ) ‏ ‏: قَالَ الْخَطَّابِيُّ : هَذَا خِطَاب لِأَهْلِ الْمَدِينَة وَلِمَنْ كَانَ قِبْلَته عَلَى ذَلِكَ السَّمْت , وَأَمَّا مَنْ كَانَتْ قِبْلَته إِلَى جِهَة الْغَرْب وَالشَّرْق فَإِنَّهُ لَا يُغَرِّب وَلَا يُشَرِّق ‏ ‏( مَرَاحِيض ) ‏ ‏: بِفَتْحِ الْمِيم وَبِالْحَاءِ الْمُهْمَلَة وَالضَّاد الْمُعْجَمَة : جَمْع مِرْحَاض بِكَسْرِ الْمِيم , وَهُوَ الْبَيْت الْمُتَّخَذ لِقَضَاءِ حَاجَة الْإِنْسَان. ‏",
//         "searchTerm": " حدثنا مسدد بن مسرهد حدثنا سفيان عن الزهري عن عطاء بن يزيد الليثي عن أبي أيوب رواية قال إذا أتيتم الغائط فلا تستقبلوا القبلة بغائط ولا بول ولكن شرقوا أو غربوا فقدمنا الشام فوجدنا مراحيض قد بنيت قبل القبلة فكنا ننحرف عنها ونستغفر الله "
//       },
//       {
//         "number": 7,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُوسَى بْنُ إِسْمَعِيلَ ‏ ‏حَدَّثَنَا ‏ ‏وُهَيْبٌ ‏ ‏حَدَّثَنَا ‏ ‏عَمْرُو بْنُ يَحْيَى ‏ ‏عَنْ ‏ ‏أَبِي زَيْدٍ ‏ ‏عَنْ ‏ ‏مَعْقِلِ بْنِ أَبِي مَعْقِلٍ الْأَسَدِيِّ ‏ ‏قَالَ ‏ ‏نَهَى رَسُولُ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏أَنْ نَسْتَقْبِلَ الْقِبْلَتَيْنِ بِبَوْلٍ أَوْ ‏ ‏غَائِطٍ ‏ ‏قَالَ ‏ ‏أَبُو دَاوُد ‏ ‏وَأَبُو زَيْدٍ ‏ ‏هُوَ مَوْلَى ‏ ‏بَنِي ثَعْلَبَةَ ‏",
//         "description": "‏ ‏( أَبِي زَيْد ) ‏ ‏: اِسْمه الْوَلِيد ‏ ‏( الْقِبْلَتَيْنِ ) ‏ ‏: الْكَعْبَة وَبَيْت الْمَقْدِسِ , وَهَذَا قَدْ يَحْتَمِل أَنْ يَكُون عَلَى مَعْنَى الِاحْتِرَام لِبَيْتِ الْمَقْدِسِ , إِذْ كَانَتْ هَذِهِ قِبْلَة لَنَا , وَيَحْتَمِل أَنْ يَكُون مِنْ أَجْل اِسْتِدْبَار الْكَعْبَة , لِأَنَّ مَنْ اِسْتَقْبَلَ بَيْت الْمَقْدِسِ بِالْمَدِينَةِ فَقَدْ اِسْتَدْبَرَ الْكَعْبَة. ‏",
//         "searchTerm": " حدثنا موسى بن إسمعيل حدثنا وهيب حدثنا عمرو بن يحيى عن أبي زيد عن معقل بن أبي معقل الأسدي قال نهى رسول الله صلى الله عليه وسلم أن نستقبل القبلتين ببول أو غائط قال أبو داود وأبو زيد هو مولى بني ثعلبة "
//       },
//       {
//         "number": 8,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ ‏ ‏حَدَّثَنَا ‏ ‏صَفْوَانُ بْنُ عِيسَى ‏ ‏عَنْ ‏ ‏الْحَسَنِ بْنِ ذَكْوَانَ ‏ ‏عَنْ ‏ ‏مَرْوَانَ الْأَصْفَرِ ‏ ‏قَالَ ‏ ‏رَأَيْتُ ‏ ‏ابْنَ عُمَرَ ‏ ‏أَنَاخَ رَاحِلَتَهُ ‏ ‏مُسْتَقْبِلَ الْقِبْلَةِ ثُمَّ جَلَسَ يَبُولُ إِلَيْهَا فَقُلْتُ يَا ‏ ‏أَبَا عَبْدِ الرَّحْمَنِ ‏ ‏أَلَيْسَ قَدْ نُهِيَ عَنْ هَذَا قَالَ بَلَى إِنَّمَا ‏ ‏نُهِيَ عَنْ ذَلِكَ فِي الْفَضَاءِ فَإِذَا كَانَ بَيْنَكَ وَبَيْنَ الْقِبْلَةِ شَيْءٌ يَسْتُرُكَ فَلَا بَأْسَ ‏",
//         "description": "‏ ‏( أَنَاخَ ) ‏ ‏: أَيْ أَقْعَدَ , يُقَال أَنَاخَ الرَّجُل الْجَمَل إِنَاخَة ‏ ‏( رَاحِلَته ) ‏ ‏: الرَّاحِلَة الْمَرْكَب مِنْ الْإِبِل ذَكَرًا كَانَ أَوْ أُنْثَى. ‏",
//         "searchTerm": " حدثنا محمد بن يحيى بن فارس حدثنا صفوان بن عيسى عن الحسن بن ذكوان عن مروان الأصفر قال رأيت ابن عمر أناخ راحلته مستقبل القبلة ثم جلس يبول إليها فقلت يا أبا عبد الرحمن أليس قد نهي عن هذا قال بلى إنما نهي عن ذلك في الفضاء فإذا كان بينك وبين القبلة شيء يسترك فلا بأس "
//       },
//       {
//         "number": 9,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ ‏ ‏عَنْ ‏ ‏مَالِكٍ ‏ ‏عَنْ ‏ ‏يَحْيَى بْنِ سَعِيدٍ ‏ ‏عَنْ ‏ ‏مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ ‏ ‏عَنْ ‏ ‏عَمِّهِ ‏ ‏وَاسِعِ بْنِ حَبَّانَ ‏ ‏عَنْ ‏ ‏عَبْدِ اللَّهِ بْنِ عُمَرَ ‏ ‏قَالَ ‏ ‏لَقَدْ ارْتَقَيْتُ عَلَى ظَهْرِ الْبَيْتِ ‏ ‏فَرَأَيْتُ رَسُولَ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏عَلَى لَبِنَتَيْنِ مُسْتَقْبِلَ ‏ ‏بَيْتِ الْمَقْدِسِ ‏ ‏لِحَاجَتِهِ ‏",
//         "description": "‏ ‏( لَبِنَتَيْنِ ) ‏ ‏: بِفَتْحِ اللَّام وَكَسْر الْمُوَحَّدَة وَفَتْح النُّون تَثْنِيَة لَبِنَة وَهِيَ مَا تُصْنَع مِنْ الطِّين أَوْ غَيْره لِلْبِنَاءِ قَبْل أَنْ يُحْرَق. ‏",
//         "searchTerm": " حدثنا عبد الله بن مسلمة عن مالك عن يحيى بن سعيد عن محمد بن يحيى بن حبان عن عمه واسع بن حبان عن عبد الله بن عمر قال لقد ارتقيت على ظهر البيت فرأيت رسول الله صلى الله عليه وسلم على لبنتين مستقبل بيت المقدس لحاجته "
//       },
//       {
//         "number": 10,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُحَمَّدُ بْنُ بَشَّارٍ ‏ ‏حَدَّثَنَا ‏ ‏وَهْبُ بْنُ جَرِيرٍ ‏ ‏حَدَّثَنَا ‏ ‏أَبِي ‏ ‏قَالَ سَمِعْتُ ‏ ‏مُحَمَّدَ بْنَ إِسْحَقَ ‏ ‏يُحَدِّثُ عَنْ ‏ ‏أَبَانَ بْنِ صَالِحٍ ‏ ‏عَنْ ‏ ‏مُجَاهِدٍ ‏ ‏عَنْ ‏ ‏جَابِرِ بْنِ عَبْدِ اللَّهِ ‏ ‏قَالَ ‏ ‏نَهَى نَبِيُّ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِبَوْلٍ فَرَأَيْتُهُ قَبْلَ أَنْ يُقْبَضَ بِعَامٍ يَسْتَقْبِلُهَا ‏",
//         "description": "‏ ‏( قَبْل أَنْ يُقْبَض بِعَامٍ ) ‏ ‏: قَالَ الْخَطَّابِيُّ : وَفِي هَذَا بَيَان مِنْ صِحَّته مَنْ فَرَّقَ بَيْن الْبُنْيَان وَالصَّحْرَاء , غَيْر أَنَّ جَابِرًا تَوَهَّمَ أَنَّ النَّهْي كَانَ عَلَى الْعُمُوم , فَحَصَلَ الْأَمْر فِي ذَلِكَ عَلَى النَّسْخ. ‏",
//         "searchTerm": " حدثنا محمد بن بشار حدثنا وهب بن جرير حدثنا أبي قال سمعت محمد بن إسحق يحدث عن أبان بن صالح عن مجاهد عن جابر بن عبد الله قال نهى نبي الله صلى الله عليه وسلم أن نستقبل القبلة ببول فرأيته قبل أن يقبض بعام يستقبلها "
//       },
//       {
//         "number": 11,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏زُهَيْرُ بْنُ حَرْبٍ ‏ ‏حَدَّثَنَا ‏ ‏وَكِيعٌ ‏ ‏عَنْ ‏ ‏الْأَعْمَشِ ‏ ‏عَنْ ‏ ‏رَجُلٍ ‏ ‏عَنْ ‏ ‏ابْنِ عُمَرَ ‏ ‏أَنَّ النَّبِيَّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏كَانَ ‏ ‏إِذَا أَرَادَ حَاجَةً لَا يَرْفَعُ ثَوْبَهُ حَتَّى يَدْنُوَ مِنْ الْأَرْضِ ‏ ‏قَالَ ‏ ‏أَبُو دَاوُد ‏ ‏رَوَاهُ ‏ ‏عَبْدُ السَّلَامِ بْنُ حَرْبٍ ‏ ‏عَنْ ‏ ‏الْأَعْمَشِ ‏ ‏عَنْ ‏ ‏أَنَسِ بْنِ مَالِكٍ ‏ ‏وَهُوَ ضَعِيفٌ ‏ ‏قَالَ ‏ ‏أَبُو عِيسَى الرَّمْلِيُّ ‏ ‏حَدَّثَنَا ‏ ‏أَحْمَدُ بْنُ الْوَلِيدِ ‏ ‏حَدَّثَنَا ‏ ‏عَمْرُو بْنُ عَوْنٍ ‏ ‏أَخْبَرَنَا ‏ ‏عَبْدُ السَّلَامِ ‏ ‏بِهِ ‏",
//         "description": "‏ ‏( عَنْ رَجُل ) ‏ ‏: قِيلَ : هُوَ قَاسِم بْن مُحَمَّد أَحَدُ الْأَئِمَّة الثِّقَاة , وَقِيلَ : هُوَ غِيَاث بْن إِبْرَاهِيم أَحَد الضُّعَفَاء \"\" وَهُوَ ضَعِيف \"\" : قَالَ السُّيُوطِيُّ : لَيْسَ مُرَاده تَضْعِيف عَبْد السَّلَام لِأَنَّهُ ثِقَة حَافِظ مِنْ رِجَال الصَّحِيحَيْنِ بَلْ تَضْعِيف مَنْ قَالَ عَنْ أَنَس , لِأَنَّ الْأَعْمَش لَمْ يَسْمَع مِنْ أَنَس وَلِذَا قَالَ مُرْسَل , وَيُوجَد فِي بَعْض النُّسَخ بَعْد قَوْل الْمُؤَلِّف وَهُوَ ضَعِيف هَذِهِ الْعِبَارَة : قَالَ أَبُو عِيسَى الرَّمْلِيّ حَدَّثَنَا أَحْمَدُ بْن الْوَلِيد حَدَّثَنَا عَمْرو بْن عَوْن حَدَّثَنَا عَبْد السَّلَام بِهِ. ‏ ‏اِنْتَهَى ‏ ‏قُلْت : أَبُو عِيسَى هُوَ إِسْحَاق وَرَّاق أَبِي دَاوُدَ , وَهَذِهِ إِشَارَة مِنْ الرَّمْلِيّ إِلَى أَنَّ الْحَدِيث اِتَّصَلَ إِلَيْهِ مِنْ غَيْر طَرِيق شَيْخه أَبِي دَاوُدَ , فَهَذِهِ الْعِبَارَة مِنْ رِوَايَة أَبِي عِيسَى الرَّمْلِيّ إِلَّا مِنْ رِوَايَة اللُّؤْلُؤِيّ عَنْ أَبِي دَاوُدَ , فَلَعَلَّ بَعْض النُّسَّاخ لِرِوَايَةِ اللُّؤْلُؤِيّ اِطَّلَعَ عَلَى رِوَايَة الرَّمْلِيّ فَأَدْرَجَهَا فِي نُسْخَة اللُّؤْلُؤِيّ , وَمُرَاده بِذَلِكَ أَنَّهُ لَمَّا كَانَتْ رِوَايَة عَبْد السَّلَام غَيْر مَوْصُولَة أَشَارَ بِوَصْلِهَا بِرِوَايَةِ أَبِي عِيسَى الرَّمْلِيّ. ‏",
//         "searchTerm": " حدثنا زهير بن حرب حدثنا وكيع عن الأعمش عن رجل عن ابن عمر أن النبي صلى الله عليه وسلم كان إذا أراد حاجة لا يرفع ثوبه حتى يدنو من الأرض قال أبو داود رواه عبد السلام بن حرب عن الأعمش عن أنس بن مالك وهو ضعيف قال أبو عيسى الرملي حدثنا أحمد بن الوليد حدثنا عمرو بن عون أخبرنا عبد السلام به "
//       },
//       {
//         "number": 12,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ ‏ ‏حَدَّثَنَا ‏ ‏ابْنُ مَهْدِيٍّ ‏ ‏حَدَّثَنَا ‏ ‏عِكْرِمَةُ بْنُ عَمَّارٍ ‏ ‏عَنْ ‏ ‏يَحْيَى بْنِ أَبِي كَثِيرٍ ‏ ‏عَنْ ‏ ‏هِلَالِ بْنِ عِيَاضٍ ‏ ‏قَالَ حَدَّثَنِي ‏ ‏أَبُو سَعِيدٍ ‏ ‏قَالَ ‏ ‏سَمِعْتُ رَسُولَ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏يَقُولُ ‏ ‏لَا يَخْرُجْ الرَّجُلَانِ يَضْرِبَانِ ‏ ‏الْغَائِطَ ‏ ‏كَاشِفَيْنِ عَنْ عَوْرَتِهِمَا يَتَحَدَّثَانِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يَمْقُتُ عَلَى ذَلِكَ ‏ ‏قَالَ ‏ ‏أَبُو دَاوُد ‏ ‏هَذَا لَمْ يُسْنِدْهُ إِلَّا ‏ ‏عِكْرِمَةُ بْنُ عَمَّارٍ ‏",
//         "description": "‏ ‏( عِكْرِمَة بْن عَمَّار ) ‏ ‏: الْعِجْلِيُّ : أَحَد الْأَئِمَّة وَثَّقَهُ اِبْن مَعِين وَالْعِجْلِيّ , وَتَكَلَّمَ الْبُخَارِيّ وَأَحْمَدُ وَالنَّسَائِيُّ فِي رِوَايَته عَنْ يَحْيَى بْن أَبِي كَثِير , وَأَحْمَدُ فِي إِيَاس بْن سَلَمَة. ‏ ‏( لَا يَخْرُج الرَّجُلَانِ ) ‏ ‏: ذِكْرُ الرَّجُلَيْنِ فِي الْحَدِيث خَرَجَ مَخْرَج الْغَالِب وَإِلَّا فَالْمَرْأَتَانِ وَالْمَرْأَةُ وَالرَّجُلُ أَقْبَحُ مِنْ ذَلِكَ ‏ ‏( يَضْرِبَانِ الْغَائِط ) ‏ ‏: يُقَال ضَرَبْت الْأَرْض إِذَا أَتَيْنَا بِخَلَاءٍ , وَضَرَبْت فِي الْأَرْض إِذَا سَافَرْت , يُقَال وَيَضْرِب الْغَائِط إِذَا ذَهَبَ لِقَضَاءِ الْحَاجَة. ‏ ‏وَالْمُرَاد هَاهُنَا يَقْضِيَانِ الْغَائِط ‏ ‏( كَاشِفَيْنِ ) ‏ ‏: مَنْصُوب عَلَى الْحَال ‏ ‏( يَمْقُت ) ‏ ‏: الْمَقْت الْبُغْض , وَرَوَاهُ اِبْن حِبَّان فِي صَحِيحه بِلَفْظِ \"\" لَا يَقْعُد الرَّجُلَانِ عَلَى الْغَائِط يَتَحَدَّثَانِ , يَرَى كُلٌّ مِنْهُمَا عَوْرَة صَاحِبه , فَإِنَّ اللَّه يَمْقُت عَلَى ذَلِكَ \"\" وَسِيَاق اللَّفْظ يَدُلّ عَلَى أَنَّ الْمَقْت عَلَى الْمَجْمُوع لَا عَلَى مُجَرَّد الْكَلَام ‏ ‏( لَمْ يُسْنِدهُ إِلَّا عِكْرِمَة بْن عَمَّار ) ‏ ‏: وَعِكْرِمَة عَنْ يَحْيَى مُتَكَلَّم فِيهِ وَمَعَ هَذَا فَهُوَ مُتَفَرِّد فَلَا يَصْلُح إِسْنَاده , وَفِي بَعْض النُّسَخ بَعْد قَوْله إِلَّا عِكْرِمَة هَذِهِ الْعِبَارَة : حَدَّثَنَا أَبَان حَدَّثَنَا يَحْيَى بِهَذَا , يَعْنِي حَدِيث عِكْرِمَة بْن عَمَّار. ‏ ‏اِنْتَهَى. ‏ ‏قُلْت : لَيْسَتْ هَذِهِ الْعِبَارَة لِلْمُؤَلِّفِ أَصْلًا , لِأَنَّ أَبَا دَاوُدَ ذَكَرَ أَنَّهُ لَمْ يُسْنِدهُ إِلَّا عِكْرِمَة فَلَمْ يَقِف عَلَيْهِ أَبُو دَاوُدَ مُسْنَدًا مِنْ غَيْر رِوَايَة عِكْرِمَة فَأَرَادَ مُلْحِقُ هَذِهِ الْعِبَارَةِ الِاسْتِدْرَاكَ عَلَى أَبِي دَاوُدَ بِأَنَّهُ قَدْ أَسْنَدَهُ عَنْ يَحْيَى بْن أَبِي كَثِير أَبَانُ بْنُ يَزِيدَ الْعَطَّارُ , لَكِنْ لَمْ أَقِف عَلَى نِسْبَة هَذِهِ الْعِبَارَة لِأَحَدٍ مِنْ الْأَئِمَّة. ‏",
//         "searchTerm": " حدثنا عبيد الله بن عمر بن ميسرة حدثنا ابن مهدي حدثنا عكرمة بن عمار عن يحيى بن أبي كثير عن هلال بن عياض قال حدثني أبو سعيد قال سمعت رسول الله صلى الله عليه وسلم يقول لا يخرج الرجلان يضربان الغائط كاشفين عن عورتهما يتحدثان فإن الله عز وجل يمقت على ذلك قال أبو داود هذا لم يسنده إلا عكرمة بن عمار "
//       },
//       {
//         "number": 13,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏عُثْمَانُ ‏ ‏وَأَبُو بَكْرِ ‏ ‏ابْنَا ‏ ‏أَبِي شَيْبَةَ ‏ ‏قَالَا حَدَّثَنَا ‏ ‏عُمَرُ بْنُ سَعْدٍ ‏ ‏عَنْ ‏ ‏سُفْيَانَ ‏ ‏عَنْ ‏ ‏الضَّحَّاكِ بْنِ عُثْمَانَ ‏ ‏عَنْ ‏ ‏نَافِعٍ ‏ ‏عَنْ ‏ ‏ابْنِ عُمَرَ ‏ ‏قَالَ ‏ ‏مَرَّ رَجُلٌ عَلَى النَّبِيِّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏وَهُوَ يَبُولُ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ ‏ ‏قَالَ ‏ ‏أَبُو دَاوُد ‏ ‏وَرُوِيَ عَنْ ‏ ‏ابْنِ عُمَرَ ‏ ‏وَغَيْرِهِ ‏ ‏أَنَّ النَّبِيَّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏تَيَمَّمَ ثُمَّ رَدَّ عَلَى الرَّجُلِ السَّلَامَ ‏",
//         "description": "‏ ‏( فَلَمْ يَرُدَّ عَلَيْهِ ) ‏ ‏: الْجَوَاب. ‏ ‏وَفِي هَذَا دَلَالَةٌ عَلَى أَنَّ الْمُسْلِم فِي هَذَا الْحَال لَا يَسْتَحِقّ جَوَابًا , وَهَكَذَا فِي رِوَايَة مُسْلِم وَأَصْحَاب السُّنَن مِنْ طَرِيق الضَّحَّاك عَنْ نَافِع عَنْ اِبْن عُمَر قَالَ \"\" مَرَّ رَجُل عَلَى النَّبِيّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُول فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ \"\" وَكَذَا فِي اِبْن مَاجَهْ مِنْ حَدِيث أَبِي هُرَيْرَة وَجَابِر بْن عَبْد اللَّه. ‏ ‏وَأَمَّا فِي رِوَايَة مُحَمَّد بْن ثَابِت الْعَبْدِيّ وَابْن الْهَاد , كِلَاهُمَا عَنْ نَافِع عَنْ اِبْن عُمَر الَّتِي أَخْرَجَهُ الْمُؤَلِّف فِي بَاب التَّيَمُّم , فَفِيهَا أَنَّ السَّلَام كَانَ بَعْد الْبَوْل. ‏ ‏وَفِي سَائِر الرِّوَايَات أَنَّ السَّلَام كَانَ حَالَة الْبَوْل , وَهَذِهِ الرِّوَايَات تَرْجِيحِيَّة ‏ ‏( وَرُوِيَ عَنْ اِبْن عُمَر وَغَيْره ) ‏ ‏: كَأَبِي الْجَهْم بْن الْحَارِث , وَوَصَلَ الْمُؤَلِّف هَاتَيْنِ الرِّوَايَتَيْنِ فِي بَاب التَّيَمُّم فِي الْحَضَر. ‏",
//         "searchTerm": " حدثنا عثمان وأبو بكر ابنا أبي شيبة قالا حدثنا عمر بن سعد عن سفيان عن الضحاك بن عثمان عن نافع عن ابن عمر قال مر رجل على النبي صلى الله عليه وسلم وهو يبول فسلم عليه فلم يرد عليه قال أبو داود وروي عن ابن عمر وغيره أن النبي صلى الله عليه وسلم تيمم ثم رد على الرجل السلام "
//       },
//       {
//         "number": 14,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُحَمَّدُ بْنُ الْمُثَنَّى ‏ ‏حَدَّثَنَا ‏ ‏عَبْدُ الْأَعْلَى ‏ ‏حَدَّثَنَا ‏ ‏سَعِيدٌ ‏ ‏عَنْ ‏ ‏قَتَادَةَ ‏ ‏عَنْ ‏ ‏الْحَسَنِ ‏ ‏عَنْ ‏ ‏حُضَيْنِ بْنِ الْمُنْذِرِ أَبِي سَاسَانَ ‏ ‏عَنْ ‏ ‏الْمُهَاجِرِ بْنِ قُنْفُذٍ ‏ ‏أَنَّهُ ‏ ‏أَتَى النَّبِيَّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏وَهُوَ يَبُولُ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ حَتَّى تَوَضَّأَ ثُمَّ اعْتَذَرَ إِلَيْهِ فَقَالَ ‏ ‏إِنِّي كَرِهْتُ أَنْ أَذْكُرَ اللَّهَ عَزَّ وَجَلَّ إِلَّا عَلَى طُهْرٍ ‏ ‏أَوْ قَالَ عَلَى طَهَارَةٍ ‏",
//         "description": "‏ ‏( أَوْ قَالَ عَلَى طَهَارَة ) ‏ ‏: هَذَا شَكّ مِنْ الْمُهَاجِر أَوْ مِمَّنْ دُونه , وَفِيهِ دَلَالَة عَلَى أَنَّهُ يَنْبَغِي لِمَنْ سَلَّمَ عَلَيْهِ فِي تِلْكَ الْحَال أَنْ يَدَعَ الرَّدّ حَتَّى يَتَوَضَّأ أَوْ يَتَيَمَّم ثُمَّ يَرُدّ , وَهَذَا إِذَا لَمْ يَخْشَ فَوْت الْمُسْلِم , وَأَمَّا إِذَا خَشِيَ فَوْته فَالْحَدِيث لَا يَدُلّ عَلَى الْمَنْع , لِأَنَّ النَّبِيّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ تَمَكَّنَ مِنْ الرَّدّ بَعْد أَنْ تَوَضَّأَ أَوْ تَيَمَّمَ عَلَى اِخْتِلَاف الرِّوَايَتَيْنِ , فَيُمْكِن أَنْ يَكُون تَرَكَهُ لِذَلِكَ طَلَبًا لِلْأَشْرَفِ وَهُوَ الرَّدّ حَال الطَّهَارَة. ‏",
//         "searchTerm": " حدثنا محمد بن المثنى حدثنا عبد الأعلى حدثنا سعيد عن قتادة عن الحسن عن حضين بن المنذر أبي ساسان عن المهاجر بن قنفذ أنه أتى النبي صلى الله عليه وسلم وهو يبول فسلم عليه فلم يرد عليه حتى توضأ ثم اعتذر إليه فقال إني كرهت أن أذكر الله عز وجل إلا على طهر أو قال على طهارة "
//       },
//       {
//         "number": 15,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُحَمَّدُ بْنُ الْعَلَاءِ ‏ ‏حَدَّثَنَا ‏ ‏ابْنُ أَبِي زَائِدَةَ ‏ ‏عَنْ ‏ ‏أَبِيهِ ‏ ‏عَنْ ‏ ‏خَالِدِ بْنِ سَلَمَةَ يَعْنِي الْفَأْفَاءَ ‏ ‏عَنْ ‏ ‏الْبَهِيِّ ‏ ‏عَنْ ‏ ‏عُرْوَةَ ‏ ‏عَنْ ‏ ‏عَائِشَةَ ‏ ‏قَالَتْ ‏ ‏كَانَ رَسُولُ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏يَذْكُرُ اللَّهَ عَزَّ وَجَلَّ عَلَى كُلِّ أَحْيَانِهِ ‏",
//         "description": "‏ ‏( الْفَأْفَاء ) ‏ ‏: لَقَب خَالِد يُعْرَف بِهِ ‏ ‏( عَنْ الْبَهِيّ ) ‏ ‏: بِفَتْحِ الْبَاء الْمُوَحَّدَة وَكَسْر الْهَاء ثُمَّ التَّحْتَانِيَّة الْمُشَدَّدَة هُوَ لَقَب وَاسْمه عَبْد اللَّه بْن بَشَّار ‏ ‏( عَلَى كُلّ أَحْيَانه ) ‏ ‏: وَأَخْرَجَ التِّرْمِذِيّ مِنْ حَدِيث عَلِيّ \"\" كَانَ يَقْرَأ الْقُرْآن عَلَى كُلّ حَال مَا لَمْ يَكُنْ جُنُبًا \"\" فِيهِ دَلَالَة عَلَى أَنَّهُ إِذَا كَانَ الْحَدَث الْأَصْغَر لَا يَمْنَعهُ عَنْ قِرَاءَة الْقُرْآن وَهُوَ أَفْضَلُ الذِّكْر كَانَ جَوَاز مَا عَدَاهُ مِنْ الْأَذْكَار بِالطَّرِيقِ الْأَوْلَى , وَكَذَلِكَ حَدِيث عَائِشَة \"\" كَانَ النَّبِيّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ يَذْكُر اللَّهَ عَلَى كُلّ أَحْيَانه \"\" مُشْعِر بِوُقُوعِ الذِّكْر مِنْهُ حَال الْحَدَث الْأَصْغَر , لِأَنَّهُ مِنْ جُمْلَة الْأَحْيَان الْمَذْكُورَة. ‏ ‏وَالْجَمْع بَيْن هَذَا الْبَاب وَالْبَاب الَّذِي قَبْله بِاسْتِحْبَابِ الطَّهَارَة لِذِكْرِ اللَّه تَعَالَى وَالرُّخْصَة فِي تَرْكهَا. ‏ ‏وَالْحَدِيث أَخْرَجَهُ مُسْلِم وَالتِّرْمِذِيّ وَابْن مَاجَهْ. ‏",
//         "searchTerm": " حدثنا محمد بن العلاء حدثنا ابن أبي زائدة عن أبيه عن خالد بن سلمة يعني الفأفاء عن البهي عن عروة عن عائشة قالت كان رسول الله صلى الله عليه وسلم يذكر الله عز وجل على كل أحيانه "
//       },
//       {
//         "number": 16,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏مُحَمَّدُ بْنُ عِيسَى ‏ ‏حَدَّثَنَا ‏ ‏حَجَّاجٌ ‏ ‏عَنْ ‏ ‏ابْنِ جُرَيْجٍ ‏ ‏عَنْ ‏ ‏حُكَيْمَةَ بِنْتِ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ ‏ ‏عَنْ ‏ ‏أُمِّهَا ‏ ‏أَنَّهَا قَالَتْ ‏ ‏كَانَ لِلنَّبِيِّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏قَدَحٌ ‏ ‏مِنْ عِيدَانٍ تَحْتَ سَرِيرِهِ يَبُولُ فِيهِ بِاللَّيْلِ ‏",
//         "description": "‏ ‏( عَنْ حُكَيْمَةَ بِنْت أُمَيْمَة ابْنَة رُقَيْقَة ) ‏ ‏: كُلّهنَّ مُصَغَّرَة ‏ ‏( قَدَح ) ‏ ‏: بِفَتْحَتَيْنِ آنِيَة مِنْ خَشَب وَالْجَمْع أَقْدَاح ‏ ‏( مِنْ عِيدَانٍ ) ‏ ‏: بِفَتْحِ الْعَيْن الْمُهْمَلَة وَسُكُون الْيَاء الْمُثَنَّاة التَّحْتِيَّة : النَّخْلَة الطِّوَال الْمُتَجَرِّدَة مِنْ السَّعَف مِنْ أَعْلَاهُ إِلَى أَسْفَله جَمْع عَيْدَانَة. ‏ ‏وَحَدِيث الْبَاب وَإِنْ كَانَ فِيهِ مَقَال لَكِنَّهُ يُؤَيِّدهُ حَدِيث عَائِشَة الَّذِي أَخْرَجَهُ النَّسَائِيُّ , وَحَدِيث الْأَسْوَد الَّذِي أَخْرَجَهُ الشَّيْخَانِ , وَفِيهِمَا \"\" أَنَّهُ لَقَدْ دُعِيَ بِالطَّسْتِ لِيَبُولَ فِيهَا \"\" الْحَدِيث , لَكِنْ وَقَعَ هَذَا فِي حَال الْمَرَض. ‏ ‏قَالَ الْمُنْذِرِيُّ : وَأَخْرَجَهُ النَّسَائِيُّ. ‏",
//         "searchTerm": " حدثنا محمد بن عيسى حدثنا حجاج عن ابن جريج عن حكيمة بنت أميمة بنت رقيقة عن أمها أنها قالت كان للنبي صلى الله عليه وسلم قدح من عيدان تحت سريره يبول فيه بالليل "
//       },
//       {
//         "number": 17,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏قُتَيْبَةُ بْنُ سَعِيدٍ ‏ ‏حَدَّثَنَا ‏ ‏إِسْمَعِيلُ بْنُ جَعْفَرٍ ‏ ‏عَنْ ‏ ‏الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ ‏ ‏عَنْ ‏ ‏أَبِيهِ ‏ ‏عَنْ ‏ ‏أَبِي هُرَيْرَةَ ‏ ‏أَنَّ رَسُولَ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏قَالَ ‏ ‏اتَّقُوا اللَّاعِنَيْنِ قَالُوا وَمَا اللَّاعِنَانِ يَا رَسُولَ اللَّهِ قَالَ الَّذِي ‏ ‏يَتَخَلَّى ‏ ‏فِي طَرِيقِ النَّاسِ أَوْ ظِلِّهِمْ ‏",
//         "description": "‏ ‏( اِتَّقُوا اللَّاعِنَيْنِ ) ‏ ‏: قَالَ الْحَافِظ الْخَطَّابِيُّ : يُرِيد الْأَمْرَيْنِ الْجَالِبَيْنِ لِلَّعْنِ الْحَامِلَيْنِ لِلنَّاسِ عَلَيْهِ وَالدَّاعِيَيْنِ إِلَيْهِ , وَذَلِكَ أَنَّ مَنْ فَعَلَهُمَا لُعِنَ وَشُتِمَ , يَعْنِي عَادَة النَّاس لَعْنُهُ فَلَمَّا صَارَا سَبَبًا لِذَلِكَ أُضِيفَ إِلَيْهِمَا الْفِعْل فَكَانَا كَأَنَّهُمَا اللَّاعِنَانِ , يَعْنِي أُسْنِدَ اللَّعْنُ إِلَيْهِمَا عَلَى طَرِيق الْمَجَاز الْعَقْلِيّ , وَقَدْ يَكُون اللَّاعِن أَيْضًا بِمَعْنَى الْمَلْعُون فَاعِل بِمَعْنَى مَفْعُول كَمَا قَالُوا مَرَّ كَاتِم أَيْ مَكْتُوم. ‏ ‏اِنْتَهَى. ‏ ‏فَعَلَى هَذَا يَكُون التَّقْدِير اتَّقُوا الْأَمْرَيْنِ الْمَلْعُونَ فَاعِلُهُمَا ‏ ‏( الَّذِي يَتَخَلَّى فِي طَرِيق النَّاس ) ‏ ‏: أَيْ يَتَغَوَّط أَوْ يَبُول فِي مَوْضِع يَمُرّ بِهِ النَّاس. ‏ ‏قَالَ فِي التَّوَسُّط شَرْح سُنَن أَبِي دَاوُدَ : الْمُرَاد بِالتَّخَلِّي التَّفَرُّد لِقَضَاءِ الْحَاجَة غَائِطًا أَوْ بَوْلًا , فَإِنَّ التَّنَجُّس وَالِاسْتِقْذَار مَوْجُودٌ فِيهِمَا. ‏ ‏فَلَا يَصِحّ تَفْسِير النَّوَوِيّ بِالتَّغَوُّطِ , وَلَوْ سُلِّمَ فَالْبَوْل يُلْحَق بِهِ قِيَاسًا. ‏ ‏وَالْمُرَاد بِالطَّرِيقِ الطَّرِيق الْمَسْلُوك لَا الْمَهْجُور الَّذِي لَا يُسْلَك إِلَّا نَادِرًا ‏ ‏( أَوْ ظِلّهمْ ) ‏ ‏: أَيْ مُسْتَظَلّ النَّاس الَّذِي اِتَّخَذُوهُ مَقِيلًا وَمَنْزِلًا يَنْزِلُونَهُ وَيَقْعُدُونَ فِيهِ , وَلَيْسَ كُلّ ظِلّ يَحْرُم الْقُعُود لِلْحَاجَةِ تَحْته , فَقَدْ قَعَدَ النَّبِيّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ لِحَاجَتِهِ تَحْت حَائِش مِنْ النَّخْل وَلِلْحَائِشِ لَا مَحَالَة ظِلّ. ‏ ‏وَالْحَدِيث يَدُلّ عَلَى تَحْرِيم التَّخَلِّي فِي طُرُق النَّاس أَوْ ظِلّهمْ لِمَا فِيهِ مِنْ إِيذَاء الْمُسْلِمِينَ بِتَنْجِيسِ مَنْ يَمُرّ بِهِ وَاسْتِقْذَاره. ‏ ‏قَالَ الْمُنْذِرِيُّ : وَأَخْرَجَهُ مُسْلِم. ‏",
//         "searchTerm": " حدثنا قتيبة بن سعيد حدثنا إسمعيل بن جعفر عن العلاء بن عبد الرحمن عن أبيه عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال اتقوا اللاعنين قالوا وما اللاعنان يا رسول الله قال الذي يتخلى في طريق الناس أو ظلهم "
//       },
//       {
//         "number": 18,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏إِسْحَقُ بْنُ سُوَيْدٍ الرَّمْلِيُّ ‏ ‏وَعُمَرُ بْنُ الْخَطَّابِ أَبُو حَفْصٍ ‏ ‏وَحَدِيثُهُ أَتَمُّ ‏ ‏أَنَّ ‏ ‏سَعِيدَ بْنَ الْحَكَمِ ‏ ‏حَدَّثَهُمْ قَالَ أَخْبَرَنَا ‏ ‏نَافِعُ بْنُ يَزِيدَ ‏ ‏حَدَّثَنِي ‏ ‏حَيْوَةُ بْنُ شُرَيْحٍ ‏ ‏أَنَّ ‏ ‏أَبَا سَعِيدٍ الْحِمْيَرِيَّ ‏ ‏حَدَّثَهُ عَنْ ‏ ‏مُعَاذِ بْنِ جَبَلٍ ‏ ‏قَالَ ‏ ‏قَالَ رَسُولُ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏اتَّقُوا الْمَلَاعِنَ الثَّلَاثَةَ الْبَرَازَ فِي ‏ ‏الْمَوَارِدِ ‏ ‏وَقَارِعَةِ الطَّرِيقِ ‏ ‏وَالظِّلِّ ‏",
//         "description": "‏ ‏( وَحَدِيثه ) ‏ ‏: أَيْ حَدِيث عُمَر بْن الْخَطَّاب ‏ ‏( أَتَمُّ ) ‏ ‏: مِنْ إِسْحَاق ‏ ‏( حَدَّثَهُ ) ‏ ‏: أَيْ حَدَّثَ أَبُو سَعِيد حَيْوَة بْن شُرَيْح ‏ ‏( الْمَلَاعِن ) ‏ ‏: جَمْع مَلْعَنَة وَهِيَ مَوَاضِع اللَّعْن ‏ ‏( الْمَوَارِد ) ‏ ‏: الْمُرَاد بِالْمَوَارِدِ الْمَجَارِي وَالطُّرُق إِلَى الْمَاء وَاحِدهَا مَوْرِد , يُقَال وَرَدْت الْمَاء إِذَا حَضَرْته لِتَشْرَب , وَالْوِرْد الْمَاء الَّذِي تَرِد عَلَيْهِ ‏ ‏( وَقَارِعَة الطَّرِيق ) ‏ ‏: أَيْ الطَّرِيقَة الَّتِي يَقْرَعهَا النَّاس بِأَرْجُلِهِمْ وَنِعَالهمْ , أَيْ يَدُقُّونَهَا وَيَمُرُّونَ عَلَيْهَا , فَهَذِهِ إِضَافَة الصِّفَة إِلَى الْمَوْصُوف , أَيْ الطَّرِيقَة الْمَقْرُوعَة وَهِيَ وَسَط الطَّرِيق ‏ ‏( وَالظِّلّ ) ‏ ‏: أَيْ ظِلّ الشَّجَرَة وَغَيْرهَا مِمَّا تَقَدَّمَ. ‏ ‏وَاعْلَمْ أَنَّ الْمُؤَلِّف أَوْرَدَ فِي هَذَا الْبَاب حَدِيثَيْنِ : الْأَوَّل فِي النَّهْي عَنْ التَّخَلِّي فِي طَرِيق النَّاس , وَقَدْ عَلِمْت أَنَّ الْمُرَاد بِالتَّخَلِّي التَّفَرُّد لِقَضَاءِ الْحَاجَة غَائِطًا أَوْ بَوْلًا , وَالثَّانِي فِي النَّهْي عَنْ الْبَرَاز , وَأَنْتَ تَعْلَم أَنَّ الْبَرَاز اِسْم لِلْفَضَاءِ الْوَاسِع مِنْ الْأَرْض , وَكَنَّوْا بِهِ عَنْ حَاجَة الْإِنْسَان , يُقَال : تَبَرَّزَ الرَّجُل إِذَا تَغَوَّطَ , فَإِنَّهُ وَإِنْ كَانَ اِسْمًا لِلْغَائِطِ لَكِنْ يُلْحَق بِهِ الْبَوْلُ. ‏ ‏قُلْت : إِيرَاد الْحَدِيثَيْنِ لَا يَخْلُو عَنْ تُكَلُّفٍ , وَاَللَّه أَعْلَمُ , وَعِلْمُهُ أَتَمُّ. ‏ ‏قَالَ الْمُنْذِرِيُّ : وَأَخْرَجَهُ اِبْن مَاجَهْ. ‏",
//         "searchTerm": " حدثنا إسحق بن سويد الرملي وعمر بن الخطاب أبو حفص وحديثه أتم أن سعيد بن الحكم حدثهم قال أخبرنا نافع بن يزيد حدثني حيوة بن شريح أن أبا سعيد الحميري حدثه عن معاذ بن جبل قال قال رسول الله صلى الله عليه وسلم اتقوا الملاعن الثلاثة البراز في الموارد وقارعة الطريق والظل "
//       },
//       {
//         "number": 19,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏أَحْمَدُ بْنُ يُونُسَ ‏ ‏حَدَّثَنَا ‏ ‏زُهَيْرٌ ‏ ‏عَنْ ‏ ‏دَاوُدَ بْنِ عَبْدِ اللَّهِ ‏ ‏عَنْ ‏ ‏حُمَيْدٍ الْحِمْيَرِيِّ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ ‏ ‏قَالَ ‏ ‏لَقِيتُ ‏ ‏رَجُلًا ‏ ‏صَحِبَ النَّبِيَّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏كَمَا صَحِبَهُ ‏ ‏أَبُو هُرَيْرَةَ ‏ ‏قَالَ ‏ ‏نَهَى رَسُولُ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏أَنْ يَمْتَشِطَ أَحَدُنَا كُلَّ يَوْمٍ أَوْ يَبُولَ فِي مُغْتَسَلِهِ ‏",
//         "description": "‏ ‏( لَقِيت رَجُلًا ) ‏ ‏: وَلَمْ يُعْرَف الرَّجُل وَهَذَا لَا يَضُرّ لِأَنَّ الصَّحَابَة كُلّهمْ عُدُول بِتَزْكِيَةِ اللَّه ‏ ‏( كَمَا صَحِبَهُ أَبُو هُرَيْرَة ) ‏ ‏: وَفِي رِوَايَة النَّسَائِيِّ أَرْبَع سِنِينَ , أَيْ صَحِبَ الرَّجُل الْمَذْكُور أَرْبَع سِنِينَ ‏ ‏( أَنْ يَمْتَشِط أَحَدنَا كُلّ يَوْم ) ‏ ‏: لِأَنَّهُ تَرَفُّه وَتَنَعُّم , وَلَا يُعَارِضهُ الْحَدِيث أَنَّهُ يُكْثِر دَهْن رَأْسه وَتَسْرِيح لِحْيَته , وَالْحَدِيث أَنَّهُ لَا يُفَارِقهُ الْمُشْط فِي سَفَر وَلَا حَضَرٍ لِأَنَّهُمَا ضَعِيفَانِ وَلَوْ سُلِّمَ فَلَا يَلْزَم مِنْ الْإِكْثَار أَنْ يَمْتَشِط كُلّ يَوْم وَصُحْبَته لِيَمْتَشِط عِنْد الْحَاجَة لَا كُلّ يَوْم , وَلَا فَرْق بَيْن الرَّأْس وَاللِّحْيَة. ‏ ‏فَإِنْ قُلْت : وَرَدَ أَنَّهُ كَانَ يُسَرِّح كُلّ يَوْم مَرَّتَيْنِ قُلْت : لَمْ أَرَ مَنْ ذَكَرَهُ إِلَّا الْغَزَالِيّ وَلَا يَخْفَى مَا فِي الْإِحْيَاء مِنْ أَحَادِيث لَا أَصْل لَهَا. ‏ ‏وَيَحْتَمِل إِلْحَاق النِّسَاء بِالرِّجَالِ فِي هَذَا الْحُكْم إِلَّا أَنَّ الْكَرَاهَة فِي حَقّهنَّ أَخَفُّ لِأَنَّ بَاب التَّزَيُّن فِي حَقّهنَّ أَوْسَعُ كَذَا فِي الْمُتَوَسِّط شَرْح سُنَن أَبِي دَاوُدَ. ‏ ‏قَالَ الْمُنْذِرِيُّ : وَأَخْرَجَهُ النَّسَائِيُّ. ‏",
//         "searchTerm": " حدثنا أحمد بن يونس حدثنا زهير عن داود بن عبد الله عن حميد الحميري وهو ابن عبد الرحمن قال لقيت رجلا صحب النبي صلى الله عليه وسلم كما صحبه أبو هريرة قال نهى رسول الله صلى الله عليه وسلم أن يمتشط أحدنا كل يوم أو يبول في مغتسله "
//       },
//       {
//         "number": 20,
//         "hadith": "‏ ‏حَدَّثَنَا ‏ ‏عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ ‏ ‏حَدَّثَنَا ‏ ‏مُعَاذُ بْنُ هِشَامٍ ‏ ‏حَدَّثَنِي ‏ ‏أَبِي ‏ ‏عَنْ ‏ ‏قَتَادَةَ ‏ ‏عَنْ ‏ ‏عَبْدِ اللَّهِ بْنِ سَرْجِسَ ‏ ‏أَنَّ رَسُولَ اللَّهِ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏نَهَى أَنْ يُبَالَ فِي الْجُحْرِ ‏ ‏قَالُوا ‏ ‏لِقَتَادَةَ ‏ ‏مَا يُكْرَهُ مِنْ الْبَوْلِ فِي الْجُحْرِ قَالَ كَانَ يُقَالُ إِنَّهَا مَسَاكِنُ الْجِنِّ ‏",
//         "description": "‏ ‏( سَرْجِس ) ‏ ‏: بِفَتْحِ أَوَّله وَسُكُون الرَّاء وَكَسْر الْجِيم وَهُوَ غَيْر مُتَصَرِّف لِلْعُجْمَةِ وَالْعِلْمِيَّة ‏ ‏( فِي الْجُحْر ) ‏ ‏: أَيْ الثَّقْب لِأَنَّهُ مَأْوَى الْهَوَامّ الْمُؤْذِيَة , فَلَا يُؤْمَنُ أَنْ يُصِيبهُ مَضَرَّة مِنْهَا ‏ ‏( قَالَ ) ‏ ‏: هِشَام الدَّسْتُوَائِيّ ‏ ‏( مَا يُكْرَه ) ‏ ‏: مَا اِسْتِفْهَامِيَّةٌ أَيْ لِمَ يُكْرَه ‏ ‏( إِنَّهَا ) ‏ ‏: أَيْ الْجِحَرَة , وَالْجِحَرَة جَمْع جُحْر كَالْأَجْحَارِ. ‏ ‏قَالَ الْمُنْذِرِيُّ : وَأَخْرَجَهُ النَّسَائِيُّ أَيْضًا. ‏",
//         "searchTerm": " حدثنا عبيد الله بن عمر بن ميسرة حدثنا معاذ بن هشام حدثني أبي عن قتادة عن عبد الله بن سرجس أن رسول الله صلى الله عليه وسلم نهى أن يبال في الجحر قالوا لقتادة ما يكره من البول في الجحر قال كان يقال إنها مساكن الجن "
//       }
//     ];
//   }
//
//   @override
//   Widget build(BuildContext context) {
//     return new Scaffold(
//       appBar: new AppBar(
//         title: new Text(
//           "Delivero Contacts",
//           style: new TextStyle(
//             color: Colors.white,
//           ),
//         ),
//       ),
//       body: Container(
//         color: Colors.white,
//         padding: EdgeInsets.all(10),
//         child: Stack(
//           children: [
//             Column(
//               children: [
//                 Padding(
//                   padding: const EdgeInsets.all(10.0),
//                   child: TextField(
//                     controller: tc,
//                     decoration: InputDecoration(hintText: 'Search...'),
//                     onChanged: (v) {
//                       setState(() {
//                         query = v;
//                         setResults(query);
//                       });
//                     },
//                   ),
//                 ),
//                 Container(
//                   color: Colors.white,
//                   child: query.isEmpty
//                       ? ListView.builder(
//                     shrinkWrap: true,
//                     itemCount: rows.length,
//                     itemBuilder: (con, ind) {
//                       return ListTile(
//                         title: Text(rows[ind]['number'].toString()),
//                         subtitle: Text(rows[ind]['hadith']),
//                         onTap: () {
//                           setState(() {
//                             tc.text = rows[ind]['contact_name'];
//                             query = rows[ind]['contact_name'];
//                             setResults(query);
//                           });
//                         },
//                       );
//                     },
//                   )
//                       : ListView.builder(
//                     shrinkWrap: true,
//                     itemCount: results.length,
//                     itemBuilder: (con, ind) {
//                       return ListTile(
//                         title: Text(results[ind]['number'].toString()),
//                         subtitle: Text(results[ind]['hadith']),
//                         onTap: () {
//                           setState(() {
//                             tc.text = results[ind]['hadith'];
//                             query = results[ind]['hadith'];
//                             setResults(query);
//                           });
//                         },
//                       );
//                     },
//                   ),
//                 ),
//               ],
//             ),
//           ],
//         ),
//       ),
//     );
//   }
//
//   void setResults(String query) {
//     results = rows
//         .where((elem) =>
//     elem['hadith']
//         .toString()
//         .toLowerCase()
//         .contains(query.toLowerCase()) ||
//         elem['hadith']
//             .toString()
//             .toLowerCase()
//             .contains(query.toLowerCase()))
//         .toList();
//   }
// }
